{"LanguageCode":"EN","SearchParameters":{},"SearchResult":{"SearchResultCount":12,"SearchResultCountAll":12,"SearchResultItems":[{"MatchedObjectId":"650627200","MatchedObjectDescriptor":{"PositionID":"ST-11438921-22-MVP","PositionTitle":"HR ASST (R&P/CLASS)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/650627200","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/650627200?PostingChannelID="],"PositionLocationDisplay":"Alexandria, Virginia","PositionLocation":[{"LocationName":"Alexandria, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Alexandria, Virginia","Longitude":-77.04308,"Latitude":38.804565}],"OrganizationName":"Washington Headquarters Services","DepartmentName":"Department of Defense","SubAgency":"Human Resources Directorate","JobCategory":[{"Name":"Human Resources Assistance","Code":"0203"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"For qualifications determinations your resume must contain the dates of employment for each position listed on your resume (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application will be marked as incomplete and you will not receive consideration for this position. It is recommended that applicants also include their hours worked per week for each employment listed on their resume. Read more about what should I include in my federal resume? at https://www.usajobs.gov/Help/faq/application/documents/resume/what-to-include/ You may qualify at the GS-8 level, if you fulfill the following qualification requirement: One year of specialized experience equivalent to the GS-7 grade level in the Federal service (experience may have been gained in the private sector) that demonstrates your ability in: position classification rules, procedures, and operations sufficient to perform tasks involved with classification; recruitment and placement or operations such as: reviewing job requirements, determining/utilizing recruitment sources to produce qualified candidates; evaluating applications; issuing certificates; coding a variety of requests for personnel actions and correcting data errors using automated HR personnel systems, such as: USA Staffing, Defense Civilian Personnel Data System (DCPDS) and Electronic Official Personnel File (eOPF.) You may qualify at the GS-7 level, if you fulfill the following qualification requirement: One year of specialized experience equivalent to the GS-6 grade level in the Federal service (experience may have been gained in the private sector) that demonstrates your ability in: knowledge of classification rules, procedures, and operations sufficient to assist with performing tasks involved with classification, recruitment and placement, or operations such as: reviewing job requirements and utilizing recruitment sources to produce qualified candidates; and knowledge of word processing software procedures and function keys. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. ACTIVE DUTY SERVICE MEMBERS: The VOW Act Chapter 21 of Title 5, United States Code (U.S.C.), Section 2108a, requires Federal agencies treat active duty service member as veterans, disabled veterans, and preference eligible, when they submit, at the time they apply for a Federal job, a \"certification\" of active service in lieu of a DD-214, assuming the service member is otherwise eligible. A \"certification\" letter should be on letterhead of the appropriate military branch of the service and contain (1) the military service dates including the expected discharge or release date; and (2) the character of service. The service member's military service dates are necessary in order to determine whether he or she meets the definition of \"veteran\" under 5 U.S.C. 2108(1). The \"certification\" must reflect the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date of submission. The \"certification\" must be signed by, or by direction of, the adjutant, personnel officer, or commander of your unit or higher headquarters and must indicate when your terminal leave will begin (if applicable), your rank, dates of active duty service, the type of discharge and character of service (i.e. honorable). Further, under paragraph (h) of the rule, agencies are required to verify a qualifying separation from military service prior to appointment, through the DD-214 or other appropriate documentation. Your preference and/or appointment eligibility will be verified prior to appointment. Active duty members that fail to provide a valid \"certification\" of service with their initial application will be found \"not eligible.\" Military members may be appointed before the effective date of their military retirement/separation if member is on terminal leave. Current or Former Political Appointees: Beginning January 1, 2010, agencies must seek prior approval from OPM before they can appoint a current or recent political appointee to a competitive or non-political excepted service position at any level under the provisions of title 5, United States Code. If you are currently or have been within the last 5 years, a political Schedule A, Schedule C, or Non-career SES employee in the executive branch, you MUST disclose that to the Human Resources Office. Submit a copy of your applicable SF-50, along with a statement that provides the following information regarding your most recent political appointment: Position title; Type of appointment (Schedule A, Schedule C, Non-career SES, or Presidential Appointee); Agency; and, Beginning and ending dates of appointment. All qualifications and time-in-grade requirements must be met by the closing date of this announcement and clearly documented in your resume. COVID-19 Vaccination: To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to E.O. 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and quarantine.","PositionRemuneration":[{"MinimumRange":"50643.0","MaximumRange":"72907.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-05-20T00:00:00.0000","PositionEndDate":"2022-05-27T23:59:59.9970","PublicationStartDate":"2022-05-20T00:00:00.0000","ApplicationCloseDate":"2022-05-27T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This position is located in the Office of the Director of Human Resources (HRD), Washington Headquarters Services (WHS). The Directorate provides a variety of key operational support and advisory assistance in civilian and military human resources, personnel security, and voluntary campaigns management functions in direct support of the Office of the Secretary of Defense (OSD) and other Defense Agencies.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"8","PromotionPotential":"8","SubAgencyName":"Human Resources Directorate","OrganizationCodes":"DD/DD21","Relocation":"True","HiringPath":["fed-transition","fed-competitive","land","mspouse","vet","fed-excepted"],"TotalOpenings":"1","AgencyMarketingStatement":"The Washington Headquarters Services (WHS) is a world-class service organization, with a dynamic workforce and unwavering commitment to service excellence. WHS is the essential services provider for the Office of the Secretary of Defense (OSD), Department of Defense (DoD) agencies, and offices in the National Capital Region.","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Incumbent typical work assignments may include the following: Perform a variety of tasks to support Human Resources Specialists in recruitment and placement efforts. Review personnel actions for accuracy of effective dates, presence of supporting documentation, and validity of nature of action codes. Performs functions involved with the DoD Priority Placement Program (PPP) and other special hiring programs. Utilizes HR software and databases to create, edit, store, and retrieve documents/data."],"Education":"Education cannot be substituted for experience.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your r&#233;sum&#233; and supporting documentation will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. All qualified candidates will be assigned to a quality category. The category assignment is a measure of the degree in which your background matches the competencies required for this position. Your qualifications will be evaluated based on your responses to the assessment questionnaire. The assessment questionnaire link can be found under the 'How To Apply' section. Attention to DetailCustomer ServiceHuman Resources Technology UsagePersonnel Action Processing and RecordkeepingStaffing and Recruitment","HowToApply":"To apply for this position, you must complete the online application and submit the documentation specified in the Required Documents section below. A complete application package must be submitted by 11:59 PM (EST) on the closing date of the announcement (05/27/2022) to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. To view the assessment questionnaire, click here: https://apply.usastaffing.gov/ViewQuestionnaire/11438921 To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login) all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/. You are encouraged to apply online. Applying online will allow you to review and track the status of your application. Do not email or send hard copy resumes/applications to the Contact Information or Agency Information listed in this vacancy announcement. All resumes/applications received at the addresses listed in the Contact Information or Agency Information will be destroyed and will not be considered for this vacancy announcement. It is the applicant's responsibility to verify that all information in their resume and documents are legible and accurate. HR will not modify answers/documents submitted by an applicant. Washington Headquarters Services provides reasonable accommodations to applicants with disabilities. If you need a reasonable accommodation for any part of the application and hiring process, please view the \"Alternate Application\" method listed in the \"Other Information\" section of this announcement. Your requests for reasonable accommodation will be addressed on a case-by-case basis. Please visit the following link for more information http://http://www.esd.whs.mil/Directives/issuances/admin_inst/","WhatToExpectNext":"Once your online application is submitted you will receive a confirmation notification by email. Your application will be evaluated by the Human Resources Office to determine your eligibility for the position. After the evaluation is complete, you will receive another notification regarding the status of your application. Stay informed of changes to your application status by signing up for automatic email alerts at: https://www.usajobs.gov/Applicant/Application/ListApplications? Washington Headquarters Services is an Equal Employment Opportunity employer. Washington Headquarters Services uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, visit: http://www.dhs.gov/E-Verify","RequiredDocuments":"YOU ARE REQUIRED TO DOCUMENT IN YOUR APPLICATION PACKAGE EVIDENCE THAT SUPPORTS YOUR ELIGIBILITY AND QUALIFICATION CLAIMS. You MUST upload the applicable documents with your application package. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume may be submitted in any format that includes your name and contact information (telephone number and/or email).\nIf you submit more than one copy of your resume, only the most recent version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you will not be considered for this vacancy. Are you applying for a promotion? If you are a current or former Federal Civilian employee and applying for a higher grade than the grade that you currently or formerly held within the last 52 weeks, you are required to provide SF-50(s) that show you have held the next lower grade for at least one year. Some SF-50s effective within the last 52 weeks will not demonstrate you have held the next lower grade for at least one year (e.g. General Adjustment SF-50 from this year). In many cases, you are required to provide two (2) SF-50s to determine you meet the one-year time-in-grade requirement and eligibility for promotion.\nExamples of appropriate SF-50s include: Appointment or Promotion SF-50 AND another SF-50 with an effective date on or after one year from the appointment or promotion at the same grade level; Within-Grade Increase (WGI) SF-50s showing regular step increase received for the same grade, etc. 2. Other supporting documents: Cover Letter, optional Most recent SF-50 (dated within the last 52 weeks before the closing date of this JOA for current federal employees), \"Notification of Personnel Action\" showing you are/were in the competitive service and the highest grade held (WHS serviced employees SF-50s will be verified via eOPF). DD-214, SF-15 Form and VA letter, or certification of expected discharge or release from active duty from Veterans for consideration under Veteran hiring authorities Noncompetitive appointment authority documentation, if applicable Career Transition Assistance Program/Interagency Career Transition Assistance Program documentation, if applicable (e.g., Certification of Expected Separation, Reduction-In-Force Separation Notice, or Notice of Proposed Removal; SF-50 that documents the RIF separation action; and most recent performance appraisal.) PPP Registrants/Eligibles: Must submit the following applicable documents: 1) PPP registration 2) PCS orders (if applicable) ARE YOU A VETERAN CLAIMING SOLE SURVIVORSHIP PREFERENCE OR 5-POINT VETERANS' PREFERENCE?\n1. You must provide legible copy/copies of the following: DD-214, \"Certificate of Release or Discharge from Active Duty,\" showing all dates of service, type of discharge as well as character of service (Honorable, General, etc.) or Statement of Service/Proof of Service (in lieu of a DD-214) from your command or local Personnel Support Detachment (PSD). The Statement of Service/Proof of Service must provide all dates of service, the expected date of discharge and anticipated character of service (Honorable, General, etc.). Veterans should upload their DD-214 once they receive it upon separation.\n2. You should also document your complete military service information in the Veterans Preference and Military Service Section of the assessment questionnaire (type of preference, dates of service, date of VA letter, character of service, disability claim and rank and date of retirement if retired). ARE YOU A DISABLED VETERAN or CLAIMING 10-POINT VETERANS' PREFERENCE?\n1. Disabled veterans, veterans, widows, spouses or the mother of a veteran, who are eligible for 10-point veterans' preference, you must provide legible copies of the following: Applicable supporting documents as noted on Standard Form-15 (SF-15). To obtain a copy of SF-15, go to: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"PPP PILOT: The Washington Headquarters Service is currently operating under an approved reengineered Priority Placement Program (PPP) pilot for all positions in its serviced workforce. This pilot is application based and current PPP registrants who are registered for activity codes 293A and 295A (regardless of the location) are required to apply to the job announcement via USAJobs in order to exercise their priority placement status. This pilot permits priority candidates to be assessed with other competitive applicants. Anyone claiming priority status must provide a copy of their PPP registration and supporting documentation (e.g. RIF notice, Certification of Expected Separation) at the time of application to verify priority placement and eligibility. MILITARY SPOUSE PREFERENCE: Military spouse preference applicants are required to apply to job announcement via USAJobs in order to exercise their preference status. The application must include signed Military Spouse PPP Self-Certification Checklist, Marriage Certificate or License, Sponsor's PCS orders at the time of application to be considered. MSP applicants will receive priority consideration at the FPL, and if selected, will be placed at the FPL. Other priority consideration programs will continue under their current operating procedures. A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. If you are unable to apply online, you must request an alternative application. Please view the following link for information on how to obtain an alternative application https://help.usastaffing.gov/Apply/index.php?%20title=Alternate_Application_Information Appointment Authorities: For more information on appointment authority eligibility requirements: https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/individuals-with-disabilities/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/veterans/ https://www.usajobs.gov/Help/working-in-government/unique-hiring-paths/military-spouses/ Other Special Appointment Authorities https://www.usajobs.gov/ Interchange Agreements https://www.opm.gov/policy-data-oversight/hiring-information/competitive-hiring/#url=Types-of-Appointments Career Transition Assistance Programs: These programs apply to employees who have been involuntarily separated from a Federal service position within the competitive service or Federal service employees whose positions have been deemed surplus or no longer needed. To receive selection priority for this position, you must: (1) meet CTAP or ICTAP eligibility criteria; (2) be rated well-qualified for the position with a score of 85 or above; and, (3) submit the appropriate documentation to support your CTAP or ICTAP eligibility. For more information visit: https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/ Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. http://www.esd.whs.mil/DD/DoD-Issuances/140025/ Nepotism: Under the provisions of 5 USC 3110, an individual may not be appointed into a position if the position is under the supervisory chain of command of a relative. Additional vacancies may be filled by this announcement.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"whs.job.application.assistance@mail.mil","SecurityClearance":"Secret","DrugTestRequired":"True","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"607945000","MatchedObjectDescriptor":{"PositionID":"SCAH214629310758S","PositionTitle":"Human Resources Specialist (Classification/Recruitment &Placement)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/607945000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/607945000?PostingChannelID="],"PositionLocationDisplay":"Anniston Army Depot, Alabama","PositionLocation":[{"LocationName":"Anniston Army Depot, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Anniston Army Depot, Alabama","Longitude":-85.9501,"Latitude":33.6842}],"OrganizationName":"US Army Civilian Human Resources Agency","DepartmentName":"Department of the Army","SubAgency":"South Central Regional Director's OFC Anniston Army Depot Civilian Personnel Advisory Center","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities.\nCurrent Department of Army Civilian EmployeesCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Interagency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Department of Defense (DoD) TransferPriority Placement Program, DoD Military Spouse Preference (MSP) EligibleVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. SPECIALIZED EXPERIENCE: One year of specialized experience which includes: 1) Interpreting and applying federal civilian human resources classification, recruitment and placement regulations, laws, policies and practices in regards to Federal Civilian pay plans such as General Schedule and Federal Wage System, etc? 2) Advising on procedural and regulatory requirements governing the merit promotion process and the use of internal/external recruitment strategies to aid in strategic recruitment planning for Federal Civilian positions; 3) Creating federal civilian job announcements, determining applicant eligibility and qualifications, and issuing referral lists utilizing an automated tool such as USA Staffing; 4) Setting pay on a variety of personnel actions in the Federal Civilian service; 5) Providing position classification advisory services and classifying Federal Civilian positions; 6) utilizing civilian human resource automation/software such as DCPDS to process personnel actions; and 7) Providing technical advice and quality control review to lower graded human resource specialist. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-11). You will be evaluated on the basis of your level of competency in the following areas:\nHR Information Systems ApplicationOral CommunicationPersonnel and Human ResourcesStaffing and RecruitmentWritten Communication Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11).","PositionRemuneration":[{"MinimumRange":"77695.0","MaximumRange":"101008.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-07-19T00:00:00.0000","PositionEndDate":"2022-07-18T23:59:59.9970","PublicationStartDate":"2021-07-19T00:00:00.0000","ApplicationCloseDate":"2022-07-18T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: The Anniston Army Depot is located in Anniston, Alabama in the foothills of the Appalachian Mountain chain half way between Atlanta, Georgia and Birmingham, Alabama just off interstate 20. The Depot is the largest employer in Calhoun County with Approximately 4000 employees.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"None","SubAgencyName":"South Central Regional Director's OFC Anniston Army Depot Civilian Personnel Advisory Center","OrganizationCodes":"DD/ARCH","Relocation":"False","HiringPath":["fed-transition","fed-competitive","land","mspouse","vet"],"TotalOpenings":"Many","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. NOTE: Some of these are obligated positions. An obligated position is one to which an employee has statutory restoration rights or entitlement based on active military service, recovery from a compensable injury, or return rights based on an overseas tour. You will be asked to sign an agreement acknowledging that you are aware of the obligation and willing to be displaced under reduction in force procedures upon the return of the former incumbent. The initial cut-off date for referral consideration is the 15th of the month and thereafter, every 15 days as vacancies occur.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Utilize a wide range of HR practices, laws, regulations, policies, and precedents sufficient to provide expert federal civilian HR management advisory and technical services on complex and wide-impacting customer functions and work practices.","Serve as a senior HR Specialist, applying the full range of civilian HR methods, principles and practices to advise on and/or resolve the full range of operational problems in the areas of recruitment and placement and classification.","Analyze and classify individual positions descriptions.","Advise managers and supervisors on staffing requirements, resources, and problems in assigned offices involving a high degree of complexity.","Advise management on recruitment strategies, sources, special programs, recruitment, relocation, and retention incentive programs.","Manage and maintain full visibility over all Request for Personnel Actions (RPAs) from cradle to grave.","Mentor and conduct informal on-the-job training for lower graded human resource personnel."],"Education":"Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience along--no substitution of education for experience is permitted.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 07/18/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11170758). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct deposit of pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. This is a Career Program (CP) 10- Civilian Human Resource Management position. You may claim military spouse preference (MSP). If a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration. Multiple positions may be filled from this announcement. Salary includes applicable locality pay or Local Market Supplement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Permanent Change of Station (PCS) allowances may be authorized, subject to the provisions of the Joint Travel Regulations and an agency determination that a PCS move is in the Government Interest. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated timeframe identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Other","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"607946000","MatchedObjectDescriptor":{"PositionID":"SCAH214628964658S","PositionTitle":"HR SPEC (Employee Relations/Labor Relations)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/607946000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/607946000?PostingChannelID="],"PositionLocationDisplay":"Anniston Army Depot, Alabama","PositionLocation":[{"LocationName":"Anniston Army Depot, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Anniston Army Depot, Alabama","Longitude":-85.9501,"Latitude":33.6842}],"OrganizationName":"US Army Civilian Human Resources Agency","DepartmentName":"Department of the Army","SubAgency":"SOUTH CENTRAL REGIONAL DIRECTOR'S OFC,  ANNISTON ARMY DEPOT CIVILIAN PERS ADVISORY CENTER (CPAC)","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. Current Department of Army Civilian EmployeesCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Interagency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Department of Defense (DoD) TransferVeterans Employment Opportunity Act (VEOA) of 1998 In order to qualify, you must meet the experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience: One year of specialized experience which includes: Provide guidance, consultation, advice and assistance to managers, supervisors, and employees on grievances, appeals, adverse actions, employee discipline and other employee relations matters; investigate employee complaints on management policies or working conditions; conducts extensive probing and analysis to identify obscure or underlying causes of misconduct or poor performance; and advises managers about appropriate disciplinary or other corrective techniques that are responsive to a range of conduct and performance problems. You will be evaluated on the basis of your level of competency in the following areas:\nConflict ManagementInfluencing/NegotiatingOral CommunicationWritten Communication Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-11).","PositionRemuneration":[{"MinimumRange":"77695.0","MaximumRange":"101008.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-07-20T00:00:00.0000","PositionEndDate":"2022-07-19T23:59:59.9970","PublicationStartDate":"2021-07-20T00:00:00.0000","ApplicationCloseDate":"2022-07-19T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: The Anniston Army Depot is located in Anniston, Alabama in the foothills of the Appalachian Mountain chain half way between Atlanta, Georgia and Birmingham, Alabama just off interstate 20. The Depot is the largest employer in Calhoun County with Approximately 4000 employees. The initial cut-off date for referral consideration is the 10th of the month and thereafter, every 10 days as vacancies occur.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"12","HighGrade":"12","PromotionPotential":"None","SubAgencyName":"SOUTH CENTRAL REGIONAL DIRECTOR'S OFC,  ANNISTON ARMY DEPOT CIVILIAN PERS ADVISORY CENTER (CPAC)","OrganizationCodes":"DD/ARCH","Relocation":"False","HiringPath":["fed-transition","fed-competitive","land","mspouse","vet"],"TotalOpenings":"Few","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provide Management employee relations and labor services to complex and demanding organizations located on the installation while operating independently as a senior HR (LMER) on a daily basis, dealing with cases that require unique resolutions.","Advise management on appropriate disciplinary or other corrective techniques in order to assist them in responding and resolving a\nwide range and complex issues for conduct and performance problems.","Advising, focusing and training managers and supervisors on all processes of performance management.","Consult with managers, supervisors, employees, etc. to interpret/apply laws, regulations, policies, on various HR functions including grievances, appeals, adverse actions, etc.","Conduct probing and analysis to identify obscure or underling cause of misconduct or poor performance.","Develop technical/legal documents of action for management's use for resolution in LMER matters. Develop written policies, advisories,\netc. on management-employee relations function.","Knowledge of personnel management and employee/labor relations theories, principle, practice, etc.","Skill in liaison processes to resolve issues by influencing, negotiating and executing."],"Education":"Some federal jobs allow you to substitute your education for the required experience in order to qualify. For this job, you must meet the qualification requirement using experience alone--no substitution of education for experience is permitted.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 07/19/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11174658). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year probationary period may be required. Direct deposit of pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. This is a Career Program (CP) 10 - Civilian Human Resource Management position. You may claim military spouse preference (MSP). If a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration. Multiple positions may be filled from this announcement. Salary includes applicable locality pay or Local Market Supplement. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Permanent Change of Station (PCS) allowances may be authorized, subject to the provisions of the Joint Travel Regulations and an agency determination that a PCS move is in the Government Interest. Due to COVID-19, the agency is currently in an expanded telework posture. If selected, you may be expected to temporarily telework, even if your home is located outside the local commuting area. Once employees are permitted to return to the office, you will be expected to report to the duty station listed on this announcement within a designated timeframe identified by the organization. At that time, you may be eligible to request to continue to telework one or more days a pay period depending upon the terms of the agency's telework policy.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"639668800","MatchedObjectDescriptor":{"PositionID":"NCDE223491063845S","PositionTitle":"Human Resources Specialist (Military)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/639668800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/639668800?PostingChannelID="],"PositionLocationDisplay":"Fort McCoy, Wisconsin","PositionLocation":[{"LocationName":"Fort McCoy, Wisconsin","CountryCode":"United States","CountrySubDivisionCode":"Wisconsin","CityName":"Fort McCoy, Wisconsin","Longitude":-90.6832,"Latitude":44.0099}],"OrganizationName":"U.S. Army Reserve Command","DepartmentName":"Department of the Army","SubAgency":"88th Readiness Division","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"POSITION IS ANNOUNCED AS A STANDING REGISTER (OPEN CONTINUOUS RECRUITMENT): First cutoff date to evaluate candidates will be March 14, 2022 at 11:59 PM. Application packages received after this date will be evaluated at a future cutoff date to be determined based on the needs of the agency. Application packages must be complete at the time referral certificates are issued. Who May Apply: Only applicants who meet one of the employment authority categories below are eligible to apply for this job. You will be asked to identify which category or categories you meet, and to provide documents which prove you meet the category or categories you selected. See Proof of Eligibility for an extensive list of document requirements for all employment authorities. 30 Percent or More Disabled VeteransCurrent Department of Army Civilian EmployeesCurrent Permanent Department of Defense (DOD) Civilian Employee (non-Army)Executive Order (E.O.) 12721Interagency Career Transition Assistance PlanLand Management Workforce Flexibility ActMilitary Spouses, under Executive Order (E.O.) 13473Non-Appropriated Fund Instrumentality (NAFI)Non-Department of Defense (DoD) TransferOffice of Personnel Management (OPM) Interchange Agreement EligiblePeople with Disabilities, Schedule APostal Service/Peace Corps and Other Unique AuthoritiesPriority Placement Program, DoD Military Spouse Preference (MSP) EligibleReinstatementVeterans Employment Opportunity Act (VEOA) of 1998Veterans Recruitment Appointment (VRA) In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience: One year of specialized experience which includes reviewing and evaluating proposed military personnel policies and practices; processing personnel actions; and establishing personnel records. This definition of specialized experience is typical of work performed at the second lower grade/level position in the Federal service (GS-07). OR Education: Master's or equivalent graduate degree or two full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to do the work of the position, such as Human Resources. OR Combination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. You will be evaluated on the basis of your level of competency in the following areas:\nCustomer ServicePersonnel and Human ResourcesTechnical Competence Time in Grade Requirement: Applicants who have held a General Schedule (GS) position within the last 52 weeks must have 52 weeks of Federal service at the next lower grade or equivalent (GS-07).","PositionRemuneration":[{"MinimumRange":"54727.0","MaximumRange":"71146.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-03-01T00:00:00.0000","PositionEndDate":"2022-05-30T23:59:59.9970","PublicationStartDate":"2022-03-01T00:00:00.0000","ApplicationCloseDate":"2022-05-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: These positions may be filled in multiple branches of the 88th Readiness Division, Director, Human Resources Office located at Fort McCoy, Wisconsin to include Officer Management, Full Time Support-Military, Enlisted Management, Health Services, Orders, Casualty Operations, Programs & Services and the Reserve Personnel Action Center. These positions require active membership as a Soldier in the Army Reserve. For more information visit http://www.goarmy.com/reserve/jobs.html","WhoMayApply":{"Name":"","Code":""},"LowGrade":"9","HighGrade":"9","PromotionPotential":"None","SubAgencyName":"88th Readiness Division","OrganizationCodes":"DD/ARHR","Relocation":"True","HiringPath":["fed-transition","overseas","fed-competitive","disability","land","mspouse","peace","vet"],"TotalOpenings":"3","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. These are military technician positions with the US Army Reserves. Becoming a Military Technician allows you to experience the best of two worlds by taking advantage of the opportunity to become a Citizen Soldier in the US Army Reserve Military Technician program. This enables you to receive full civil service benefits and military reserve benefits. Military Technicians are a vital link between the US Army Reserves and civil service and are one of the most important keys to combat readiness. These positions may offer a $10,000 bonus (see \"Additional Information\" below).","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Provide administrative and management support for the accomplishment of military personnel functions for assigned programs.","Review personnel action requests to ensure compliance with policies and regulations.","Maintain liaison and make periodic and special visits and inspections.","Provide military personnel management support to Army Reserve units within the Readiness Support Command area of operations.","Interpret regulations and policies, and advise on appropriate action."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 05/30/2022 to receive consideration. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11403845). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on the authority you are using to apply (i.e., applying as a veteran, applying as a current permanent Federal employee, applying as a reinstatement, etc). Please review the following links to see which documents you need to provide to prove your eligibility to apply: Applicant Merit Checklist and Proof of Eligibility. As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable Proof of Eligibility to Apply: Your application must include the documents which prove you are eligible to apply for the vacancy. The Proof of Eligibility document describes authorities commonly used in merit promotion recruitment and what document(s) are required to prove you meet the requirements of the authority. You must meet the requirements of at least one of the authorities listed in the Who May Apply section above to receive further consideration. Time-in-grade documentation: If you are applying for a higher grade and your SF-50 has an effective date within the past year, it may not clearly demonstrate you meet the one year time-in-grade requirement so you will need to provide an SF-50 which clearly demonstrates you meet the time-in-grade requirements (examples of appropriate SF-50s include Promotions, Within-grade Grade/Range Increases, and SF-50s with an effective date more than one year old). NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":false,"OtherInformation":"These positions offer a $10,000 recruitment bonus to individuals who are newly appointed as civilians in the Federal Government. You are considered newly appointed if this is your first appointment as a civilian employee in the Federal Government or if you have a minimum of a 90 day break in service from a previous Federal civilian position. You may qualify with a break in service of less than 90 days only if your previous Federal civilian appointment was a time limited, or not permanent, appointment. Your recruitment bonus will be made in four payments of $2,500. You receive the first payment when you enter on duty, second payment at your first year anniversary, third payment at second year anniversary, and fourth payment at third year anniversary. To accept this recruitment bonus, you are required to make a four year service obligation to the Army Reserve Military Technician Program. If you fail to serve the specified period, you may be subject to repay the agency the recruitment incentive. New Army Reserve Military Technicians may be authorized moving expenses to their first official duty station. To be eligible to receive moving expenses, you must be a newly appointed Federal civilian employee or have a minimum of a 3 day break in service from previous Federal civilian employment. Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct deposit of pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. This is a Career Program (CP) 50 - Military Personnel Management position. You may claim military spouse preference (MSP). Multiple positions may be filled from this announcement. Salary includes applicable locality pay. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit https://www.dfas.mil/civilianemployees/civrelo/Civilian-Moving-Expenses-Tax-Deduction/ for more information. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Permanent Change of Station (PCS) allowances may be authorized, subject to the provisions of the Joint Travel Regulations and an agency determination that a PCS move is in the Government Interest. Information may be requested regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Secret","DrugTestRequired":"False","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["National security"],"TeleworkEligible":true,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"635342800","MatchedObjectDescriptor":{"PositionID":"SWEK225330050010DS","PositionTitle":"Human Resources Assistant (Military/Office Automation)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/635342800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/635342800?PostingChannelID="],"PositionLocationDisplay":"Kansas City, Missouri","PositionLocation":[{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296}],"OrganizationName":"U.S. Military Entrance Processing Command","DepartmentName":"Department of the Army","SubAgency":"Kansas City Military Entrance Processing Station (MEPS), MO","JobCategory":[{"Name":"Human Resources Assistance","Code":"0203"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"Who May Apply: US Citizens In order to qualify, you must meet the education and/or experience requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document. Specialized Experience: One year of specialized experience which includes: Providing administrative support; In-processing or screening applicants; Questioning applicants; Reviewing documents; Maintaining records; and Performing data entry.\nThis definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-04). OR Education: Four years of education above the high school level obtained in an accredited business, secretarial or technical school, junior college, college or university. OR Combination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide your semester hours of education beyond two years (total semester hours minus 60) by 60. Add the two percentages. You will be evaluated on the basis of your level of competency in the following areas:\nClericalComputer LiteracyCustomer Service","PositionRemuneration":[{"MinimumRange":"36575.0","MaximumRange":"47547.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-04T00:00:00.0000","PositionEndDate":"2022-05-30T23:59:59.9970","PublicationStartDate":"2022-02-04T00:00:00.0000","ApplicationCloseDate":"2022-05-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"About the Position: Serves as a Human Resources Assistant at the Kansas City, MO. Military Entrance Processing Station (MEPS), Provides administrative support to the Reception-Administration Control Desk (RACD), as well as the Record Maintenance & Accountability and Enlistment Processing sections. ***Applications will be reviewed and referred for selection on February 17, 2022; and again at closing date on March 07, 2022.***","WhoMayApply":{"Name":"","Code":""},"LowGrade":"5","HighGrade":"5","PromotionPotential":"None","SubAgencyName":"Kansas City Military Entrance Processing Station (MEPS), MO","OrganizationCodes":"DD/ARAP","Relocation":"False","HiringPath":["fed-transition","mspouse","public"],"TotalOpenings":"1","AgencyMarketingStatement":"Civilian employees serve a vital role in supporting the Army mission. They provide the skills that are not readily available in the military, but crucial to support military operations. The Army integrates the talents and skills of its military and civilian members to form a Total Army. The Army values diversity of perspectives, backgrounds, cultures and skills, which connects employees to organizations that are committed to building an inclusive work environment where they can contribute to their fullest potential.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Greet and account for visitors and applicants in and out of the MEPS.","Question applicants to obtain and verify complete data required for final data processing of forms and records for entry into the military service.","Gather previously non-disclosed information which would bear on moral or physical suitability for enlistment.","Fingerprint applicants using automated systems, ensuring fingerprints are classifiable (acceptable).","Verify applicant Emergency Data Records.","Screen applicant records to ascertain that all necessary documents are present according to the requirements of each military service.","Refer applicants with additional disclosed information to the appropriate enlistment, recruiting, or processing authority.","Receive requests for documents in applicant files and furnish to requester.","Assist with the preparation of transportation orders, amendments to transportation orders, and delayed entry program orders for active duty and Reserve personnel."],"Education":"FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html","Requirements":"","Evaluations":"Once the announcement has closed, a review of your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine whether you meet the qualification requirements listed on this announcement. If you are minimally qualified, your r&#233;sum&#233; and supporting documentation will be compared against your responses to the assessment questionnaire to determine your level of experience. If, after reviewing your r&#233;sum&#233; and/or supporting documentation, a determination is made that you have inflated your qualifications and/or experience, you may lose consideration for this position. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility. You should list any relevant performance appraisals and incentive awards in your resume as that information may be taken into consideration during the selection process. If selected, you may be required to provide supporting documentation. Basis for Rating: Qualified candidates will be assigned to one of three quality categories: Best Qualified, Highly Qualified and Qualified. Veteran preference eligibles are listed ahead of non-preference eligibles within each quality category. Best Qualified. Candidates in this category possess exceptional skills and experience to exceed well above the minimum requirements for the announced position. Highly Qualified. Candidates in this category possess good skills and experience above the minimum requirements for the announced position. Qualified. Candidates in this category meet the minimum experience requirements for the announced position.","HowToApply":"To apply for this position, you must complete the online questionnaire and submit the documentation specified in the Required Documents section above. The complete application package must be submitted by 11:59 PM (EST) on 05/30/2022 to receive consideration To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application (https://apply.usastaffing.gov/ViewQuestionnaire/11370010). Follow the prompts to select your r&#233;sum&#233; and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete. It is your responsibility to verify that your application package (resume, supporting documents, and responses to the questionnaire) is complete, accurate, and submitted by the closing date. Uploaded documents may take up to one hour to clear the virus scan. Additional information on how to complete the online application process and submit your online application may be found on the USA Staffing Applicant Resource Center. To verify the status of your application, log into your USAJOBS account (https://my.usajobs.gov/Account/Login), all of your applications will appear on the Welcome screen. The Application Status will appear along with the date your application was last updated. For information on what each Application Status means, visit: https://www.usajobs.gov/Help/how-to/application/status/.","WhatToExpectNext":"If you provided an email address, you will receive an email message acknowledging receipt of your application. Your application package will be used to determine your eligibility, qualifications, and quality ranking for this position. If you are determined to be ineligible or not qualified, your application will receive no further consideration.","RequiredDocuments":"The documents you are required to submit vary based on whether or not you are eligible for preference in federal employment. A complete description of preference categories and the associated required documents is in the Applicant Checklist (External). As described above, your complete application includes your resume, your responses to the online questionnaire, and documents which prove your eligibility to apply. If you fail to provide these documents, you will be marked as having an incomplete application package and you will not be considered any further. 1. Your resume: Your resume may be submitted in any format and must support the specialized experience described in this announcement. If your resume includes a photograph or other inappropriate material or content, it will not be used to make eligibility and qualification determinations and you may not be considered for this vacancy. For qualifications determinations your resume must contain hours worked per week and the dates of employment (i.e., HRS per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as incomplete and you may not receive consideration for this position. For additional information see: What to include in your resume. 2. Other supporting documents: Cover Letter, optional Most recent Performance Appraisal, if applicable This position has an individual occupational requirement and/or allows for substitution of education for experience. If you meet this requirement based on education you MUST submit a copy of your transcript with your application package or you will be rated ineligible. See: Transcripts and Licenses NOTE: Documents submitted as part of the application package, to include supplemental documents, may be shared beyond the Human Resources Office. Some supplemental documents such as military orders and marriage certificates may contain personal information for someone other than you. You may sanitize these documents to remove another person's personal information before you submit your application. You may be asked to provide an un-sanitized version of the documents if you are selected to confirm your eligibility.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/","BenefitsDisplayDefaultText":true,"OtherInformation":"Male applicants born after December 31, 1959, must complete a Pre-Employment Certification Statement for Selective Service Registration. You will be required to provide proof of U.S. Citizenship. Two year trial/probationary period may be required. Direct Deposit of Pay is required. Selection is subject to restrictions resulting from Department of Defense referral system for displaced employees. If you have retired from federal service and you are interested in employment as a reemployed annuitant, see the information in the Reemployed Annuitant information sheet. This is a Career Program (CP) 50 - Military Personnel Management position. You may claim military spouse preference. If a MSP applicant is determined best qualified and selected, placement must be at the full performance level for priority consideration. Multiple positions may be filled from this announcement. Salary includes applicable locality pay or Local Market Supplement. Interagency Career Transition Assistance Program (ICTAP). If you are a Federal employee in the competitive service and your agency has notified you in writing that you are a displaced employee eligible for ICTAP consideration, you may receive selection priority for this position. To receive selection priority, you must: (1) meet ICTAP eligibility criteria (2) be rated well-qualified for the position and; (3) submit the appropriate documentation to support your ICTAP eligibility. To be considered well-qualified and receive selection priority applicants must satisfy all qualification requirements for the position and receive a score of 90 or above. Additional information about the program is on OPM's Career Transition Resources website. If you are unable to apply online or need to fax a document you do not have in electronic form, view the following link for information regarding an Alternate Application. Payment of Permanent Change of Station (PCS) costs is not authorized, based on a determination that a PCS move is not in the Government interest. Information may be requested regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols. For more information, visit https://www.saferfederalworkforce.gov/faq/vaccinations/.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactWebsite":"https://portal.chra.army.mil/hr_public?id=app_inq","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"585173800","MatchedObjectDescriptor":{"PositionID":"AF-FY21-NH-02XX-SPLASH","PositionTitle":"Human Resources Management","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/585173800","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/585173800?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Human Resources Management","Code":"0201"},{"Name":"Equal Employment Opportunity","Code":"0260"}],"JobGrade":[{"Code":"NH"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"19543.0","MaximumRange":"142180.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"The Air Force offers qualified applicants opportunities to be hired for certain occupations covered by Direct Hire Authorities (DHA). The use of DHA is a fast-track method of hiring applicants from the public with no prior federal status using a non-traditional method of recruitment. To find additional information on \"What Is DHA\" and to view and/or apply to current DHA opportunities listed on Air Force Civilian Service's \"Direct Hire Job Board\", please click here.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"4","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public","fed-competitive","fed-excepted","disability","land","mspouse","peace","graduates","student","vet"],"TotalOpenings":"Many","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"627337100","MatchedObjectDescriptor":{"PositionID":"AF-FY22-GS-0201-SPLASH","PositionTitle":"Human Resources management","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/627337100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/627337100?PostingChannelID="],"PositionLocationDisplay":"Location Negotiable After Selection, United States","PositionLocation":[{"LocationName":"Salt Lake City, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Salt Lake City, Utah","Longitude":-111.88823,"Latitude":40.75952},{"LocationName":"Seattle, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Seattle, Washington","Longitude":-122.32945,"Latitude":47.60358},{"LocationName":"Phoenix, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Phoenix, Arizona","Longitude":-112.075775,"Latitude":33.44826},{"LocationName":"Los Angeles, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Los Angeles, California","Longitude":-118.245,"Latitude":34.0535},{"LocationName":"San Francisco, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"San Francisco, California","Longitude":-122.4196,"Latitude":37.7771},{"LocationName":"Denver, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Denver, Colorado","Longitude":-104.992256,"Latitude":39.74001},{"LocationName":"Washington, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Washington, District of Columbia","Longitude":-77.032,"Latitude":38.8904},{"LocationName":"Miami, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Miami, Florida","Longitude":-80.23742,"Latitude":25.728985},{"LocationName":"Atlanta, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Atlanta, Georgia","Longitude":-84.39111,"Latitude":33.748314},{"LocationName":"Chicago, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Chicago, Illinois","Longitude":-87.63241,"Latitude":41.88415},{"LocationName":"Indianapolis, Indiana","CountryCode":"United States","CountrySubDivisionCode":"Indiana","CityName":"Indianapolis, Indiana","Longitude":-86.14996,"Latitude":39.76691},{"LocationName":"New Orleans, Louisiana","CountryCode":"United States","CountrySubDivisionCode":"Louisiana","CityName":"New Orleans, Louisiana","Longitude":-90.07771,"Latitude":29.95369},{"LocationName":"Boston, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Boston, Massachusetts","Longitude":-71.0567,"Latitude":42.358635},{"LocationName":"Minneapolis, Minnesota","CountryCode":"United States","CountrySubDivisionCode":"Minnesota","CityName":"Minneapolis, Minnesota","Longitude":-93.26493,"Latitude":44.979034},{"LocationName":"Kansas City, Missouri","CountryCode":"United States","CountrySubDivisionCode":"Missouri","CityName":"Kansas City, Missouri","Longitude":-94.58306,"Latitude":39.10296},{"LocationName":"Albuquerque, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Albuquerque, New Mexico","Longitude":-106.649,"Latitude":35.0842},{"LocationName":"New York, New York","CountryCode":"United States","CountrySubDivisionCode":"New York","CityName":"New York, New York","Longitude":-74.0071,"Latitude":40.7146},{"LocationName":"Oklahoma City, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Oklahoma City, Oklahoma","Longitude":-97.52033,"Latitude":35.472004},{"LocationName":"Portland, Oregon","CountryCode":"United States","CountrySubDivisionCode":"Oregon","CityName":"Portland, Oregon","Longitude":-122.67563,"Latitude":45.511795},{"LocationName":"Austin, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Austin, Texas","Longitude":-97.743,"Latitude":30.2676}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"For additional information on direct hire opportunities with the Air Force please click here.","PositionRemuneration":[{"MinimumRange":"22886.0","MaximumRange":"166502.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-12-01T00:00:00.0000","PositionEndDate":"2022-11-30T23:59:59.9970","PublicationStartDate":"2021-12-01T00:00:00.0000","ApplicationCloseDate":"2022-11-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"For additional information on direct hire opportunities with the Air Force please click here. Once on the Air Force Civilian Careers website, click \"LEARN MORE ABOUT DIRECT HIRE JOBS\" and click on the LinkedIn icon located under \"To learn more about current and future Direct Hire opportunities please follow us on LinkedIn\" Information regarding opportunities, how to submit your resume and your contact information may be located on the Air Force Civilian Careers LinkedIn site.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"1","HighGrade":"15","PromotionPotential":"None","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public"],"TotalOpenings":"MANY","AgencyMarketingStatement":"IMPORTANT INFORMATION: This Job Opportunity Announcement (JOA) will be used to form a pool of qualified applicants who will be considered for direct hire vacancies as they become available.","TravelCode":"0","MajorDuties":["For additional information on direct hire opportunities with the Air Force please click here."],"Education":"","Requirements":"","Evaluations":"For additional information on direct hire opportunities with the Air Force please click here.","HowToApply":"For additional information on direct hire opportunities with the Air Force please click here.","WhatToExpectNext":"For additional information on direct hire opportunities with the Air Force please click here.","RequiredDocuments":"For additional information on direct hire opportunities with the Air Force please click here.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. Additionally, please do not disclose your vaccination status on your resume.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"611424700","MatchedObjectDescriptor":{"PositionID":"AFPC-STUDHA-10907395-0201","PositionTitle":"Human Resources Specialist (Recruitment & Placement)","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/611424700","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/611424700?PostingChannelID="],"PositionLocationDisplay":"Multiple Locations","PositionLocation":[{"LocationName":"Gunter AFB, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Gunter AFB, Alabama","Longitude":-86.2444,"Latitude":32.4077},{"LocationName":"Maxwell AFB, Alabama","CountryCode":"United States","CountrySubDivisionCode":"Alabama","CityName":"Maxwell AFB, Alabama","Longitude":-86.3577,"Latitude":32.3834},{"LocationName":"Edwards AFB, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Edwards AFB, California","Longitude":-117.8332,"Latitude":34.8898},{"LocationName":"Eglin AFB, Florida","CountryCode":"United States","CountrySubDivisionCode":"Florida","CityName":"Eglin AFB, Florida","Longitude":-86.5552,"Latitude":30.4654},{"LocationName":"Robins AFB, Georgia","CountryCode":"United States","CountrySubDivisionCode":"Georgia","CityName":"Robins AFB, Georgia","Longitude":-83.5919,"Latitude":32.64},{"LocationName":"Scott AFB, Illinois","CountryCode":"United States","CountrySubDivisionCode":"Illinois","CityName":"Scott AFB, Illinois","Longitude":-89.8714,"Latitude":38.5483},{"LocationName":"Hanscom AFB, Massachusetts","CountryCode":"United States","CountrySubDivisionCode":"Massachusetts","CityName":"Hanscom AFB, Massachusetts","Longitude":-71.2763,"Latitude":42.4587},{"LocationName":"Patuxent River, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Patuxent River, Maryland","Longitude":-76.7301,"Latitude":38.756},{"LocationName":"Kirtland AFB, New Mexico","CountryCode":"United States","CountrySubDivisionCode":"New Mexico","CityName":"Kirtland AFB, New Mexico","Longitude":-106.545,"Latitude":35.0583},{"LocationName":"Wright-Patterson AFB, Ohio","CountryCode":"United States","CountrySubDivisionCode":"Ohio","CityName":"Wright-Patterson AFB, Ohio","Longitude":-84.05,"Latitude":39.8333},{"LocationName":"Tinker AFB, Oklahoma","CountryCode":"United States","CountrySubDivisionCode":"Oklahoma","CityName":"Tinker AFB, Oklahoma","Longitude":-97.3894,"Latitude":35.422},{"LocationName":"Arnold AFB, Tennessee","CountryCode":"United States","CountrySubDivisionCode":"Tennessee","CityName":"Arnold AFB, Tennessee","Longitude":-86.0858,"Latitude":35.3925},{"LocationName":"Bexar County, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Bexar County, Texas","Longitude":-98.51991,"Latitude":29.44904},{"LocationName":"Fort Sam Houston, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Fort Sam Houston, Texas","Longitude":-98.4489,"Latitude":29.4491},{"LocationName":"Fort Worth, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Fort Worth, Texas","Longitude":-97.32925,"Latitude":32.74863},{"LocationName":"Kelly AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Kelly AFB, Texas","Longitude":-98.58329,"Latitude":29.38096},{"LocationName":"Lackland AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Lackland AFB, Texas","Longitude":-98.6181,"Latitude":29.3861},{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275},{"LocationName":"San Antonio, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"San Antonio, Texas","Longitude":-98.49462,"Latitude":29.42449},{"LocationName":"Hill AFB, Utah","CountryCode":"United States","CountrySubDivisionCode":"Utah","CityName":"Hill AFB, Utah","Longitude":-111.9896,"Latitude":41.1251},{"LocationName":"Arlington, Virginia","CountryCode":"United States","CountrySubDivisionCode":"Virginia","CityName":"Arlington, Virginia","Longitude":-77.086296,"Latitude":38.89051}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"In order to qualify, you must meet the specialized experience requirements described in the Office of Personnel Management (OPM) Qualification Standards for General Schedule Positions, Qualification Standards for General Schedule Positions, Administrative and Management Positions. SPECIALIZED EXPERIENCE:\nGS-07: Applicants must have at least one year of specialized experience equivalent to at least GS-05 grade level. Examples of specialized experience includes knowledge of Federal Human Resources employment, recruitment, and placement principles, concept, policies, and analytical techniques. OR EDUCATION: One year of graduate level education or superior academic achievement. NOTE: You must submit a copy of official transcripts. OR COMBINATION OF EDUCATION AND EXPERIENCE: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100 percent. NOTE: You must submit a copy of official transcripts. GS-09: One year specialized experience equivalent to at least GS-07 grade level which includes knowledge of other Human Resources processes sufficient to relate recruitment and placement issues to them. OR EDUCATION: Master's or equivalent graduate degree, or two full years of progressively higher level graduate education leading to such a degree or LL.B. or J.D., if related. NOTE: You must submit a copy of official transcripts. OR COMBINATION OF EDUCATION AND EXPERIENCE: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100 percent. NOTE: You must submit a copy of official transcripts. GS-11: One year specialized experience equivalent to at least GS-09 grade level which includes skill in applying basic principles, provisions, laws, regulations, practices, and techniques of staffing and recruitment. OR EDUCATION: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree or LL.M., if related. NOTE: You must submit a copy of official transcripts. OR COMBINATION OF EDUCATION AND EXPERIENCE: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100 percent. NOTE: You must submit a copy of official transcripts. GS-12: One year of specialized experience equivalent to at least the GS-11 grade level with the particular knowledge and ability to gather and analyze facts, draw conclusions from other information and communicate information clearly. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of Federal Human Resources (HR) affirmative employment, recruitment, and placement principles, policies, practices, methods, and analytical techniques.\n2. Knowledge of other HR processes sufficient to relate recruitment and placement issues to them.\n3. Skill in applying principles, provisions, laws, regulations, practices, and techniques of staffing and recruitment.\n4. Skill in troubleshooting and resolving the most difficult problems associated with providing comprehensive recruitment and placement advisory services.\n5. Ability to gather and analyze facts, draw conclusions from information, and communicate information clearly, orally and in writing. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. DEFINITION:\n*** The term \"Current post-secondary student\" means a person who is currently enrolled in, and in good academic standing at a full-time program at an institution of higher education; and is making satisfactory progress toward receipt of a baccalaureate or graduate degree; and has completed at least one year of the program. *** The term \"recent graduate\" means a person who was awarded a degree by an institution of higher education not more than two years before the date of the appointment of such person, except in the case of a person who has completed a period of obligated service in a uniform service of more than four years.","PositionRemuneration":[{"MinimumRange":"37301.0","MaximumRange":"86021.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-01T00:00:00.0000","PositionEndDate":"2022-09-30T23:59:59.9970","PublicationStartDate":"2021-10-01T00:00:00.0000","ApplicationCloseDate":"2022-09-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This public notice may be used to fill target grades (e.g. GS-7 target 12).There may be promotion potential up to the GS-12 or equivalent. May be filled at any grade level. The primary purpose of this position is to serve as HR Specialist (Recruitment & Placement) performing assignments for organizations that are designed to further develop applicable analytical and evaluative skills and techniques.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"12","PromotionPotential":"12","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["graduates"],"TotalOpenings":"Few","AgencyMarketingStatement":"The mission of the United States Air Force is to fly, fight and win...in air, space and cyberspace. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. For Direct Hire Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location. See \"Additional Information\" in this announcement for further information regarding DHA Positions.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["In a developing capacity, performs recruitment and placement assignments involving clerical and assistant, technical, and trade worker occupations.","Provide recruitment and placement, and affirmative employment advisory services, provides advice on most productive recruitment strategies for filling competitive or excepted service positions.","Participate in special initiatives, studies and projects, and affirmative employment activities.","Advise installations on regulatory compliance, other program requirements, and recommends possible alternate solutions to issues. Provide advice by using sound judgement and technical competency .","At higher grade, provide recruitment and placement services to complex and dynamic organizations requiring wide range of professional, scientific, administrative, and highly technical positions.","Prepare written correspondence and other documents to include items for newsletters, responses to congressional inquires, reports of specialist studies, briefings, responding to inquiries from employees and other customers.","Duties and responsibilities vary and may increase according to grade level."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your latest resume will be used to determine your qualifications. Applicants who disqualify themselves will not be evaluated further. \"Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement.\" More information on COVID requirements may be found at: https://www.saferfederalworkforce.gov/faq/vaccinations/.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 09/30/2022. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11208825 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"After you submit your application, you will be contacted if further evaluation or interviews are required. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply.","RequiredDocuments":"The following documents are required and must be provided with your application for this Public Notice. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application - Questionnaire Resume - For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts: If qualifying on education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service/discharge and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"For DHA Positions:\nThese positions are being filled under Direct-Hire Authority for the Department of Defense for Post-Secondary Students and Recent Graduates. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified post-secondary students and recent graduates directly into competitive service positions; these positions may be professional or administrative occupations and are located Air Force-Wide. Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location. Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Term Appointments: If you are selected for a term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position. Selective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here. Direct Deposit: All federal employees are required to have direct deposit. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11208825 If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"616210100","MatchedObjectDescriptor":{"PositionID":"U-22-DHA-11234241-DJL","PositionTitle":"Human Resources Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/616210100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/616210100?PostingChannelID="],"PositionLocationDisplay":"Multiple Locations","PositionLocation":[{"LocationName":"Schriever AFB, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Schriever AFB, Colorado","Longitude":-104.52668,"Latitude":38.801945},{"LocationName":"Joint Base Anacostia-Bolling, District of Columbia","CountryCode":"United States","CountrySubDivisionCode":"District of Columbia","CityName":"Joint Base Anacostia-Bolling, District of Columbia","Longitude":-77.01735,"Latitude":38.83941},{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275},{"LocationName":"Fairchild AFB, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"Fairchild AFB, Washington","Longitude":-117.6556,"Latitude":47.615}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","SubAgency":"AFPC CSA Force Renewal/DP2ZAA - MAJCOM's Will Vary","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To qualify for a GS-07: Completion of 1 full year of graduate level education, or bachelor's degree with Superior academic Achievement as provided in the \"General Policies and Instructions\" for Qualifications Standards Operating Manual, or 5 academic years of pre-professional study, or 1 year specialized experience equivalent to at least GS-5. Experience refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-05, or equivalent in other pay systems. Examples of specialized experience include: providing support for Human Resources (HR) specialists involved in using HR information systems; in delivering HR services to military personnel; and in classification, recruitment and placement, employee benefits, human resource development, performance management, and employee and labor management relations. Process and document HR actions for a wide variety of employee categories that involve different forms, different authorities, different action codes, and different regulatory authorities, or additional pay systems. Obtain missing data from HR files or the appropriate office; assist employees in preparing paperwork related to HR actions; review finished forms for completeness and adequacy; contact individual employees or supervisors by telephone to resolve questions before processing final actions; provide information on HR systems, processes and procedures; and/or provide brochures, applications and other HR documents to employees. This experience MUST be equivalent to at least the GS-05 level in Federal service, which could have been obtained in the private or public sectors. Applicants in the Best-qualified category will be referred to the selecting official for further review. To view qualifying educational requirements and/or combination of education and specialized experience, click on the following link:http://www.opm.gov/qualifications/standards/indexes/num-ndx.asp Once the application and selection process is complete, a review of your application will be made to ensure you meet the applicable OPM qualification requirements. To determine if you are qualified for this job, a review of your resume and supporting documentation will be made. Applicants who fail to provide the necessary documentation to support their educational grade point average/master's degree requirements, qualifying experience or veterans' preference claim will be determined incomplete, ineligible or not identified as claiming veterans' preference. Please follow all instructions carefully. Errors or omissions may affect your consideration in the referral and selection process. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of basic principles and practices of human resources.\n2. Ability to communicate effectively with others, both orally and in writing.\n3. Ability to gather facts and use effective analytical, and evaluative methods to accurately assess information and formulate solutions to problems.\n4. Ability to manage several projects simultaneously. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"43683.0","MaximumRange":"63906.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2021-10-01T00:00:00.0000","PositionEndDate":"2022-09-30T23:59:59.9970","PublicationStartDate":"2021-10-01T00:00:00.0000","ApplicationCloseDate":"2022-09-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The primary purpose of this position is to perform a variety of conventional duties relating to a variety of human relations program areas and to complete developmental assignments and training outlined in the formal training and development program.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"7","PromotionPotential":"11","SubAgencyName":"AFPC CSA Force Renewal/DP2ZAA - MAJCOM's Will Vary","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["graduates","public"],"TotalOpenings":"few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. For Direct Hire Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). See \"Additional Information\" in this announcement for further information regarding DHA Positions.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["Performs a variety of highly structured, entry-level human resources work designed to develop broader and more in-depth knowledge and skill to perform higher level assignments.","Performs a variety of routine work assignments selected by the supervisor or experienced employee who serves as training monitor.","Observes and assists an experienced employee by performing routine tasks, such as reviewing basic qualifications requirements; analyzing position data; preparing job descriptions; reviewing and applying procedures pertaining to employee relations."],"Education":"Any individual who was awarded a degree by an institution of higher education from a PUBLIC or other non-profit institution not more than two years before the date of appointment meets the basic eligibility requirement to apply for the DHA Recent Graduates Program; OR Any individual who has completed a period of obligated service in a uniformed service of more than four years and was awarded a degree by an institution of higher education from a public or other non-profit institution not more than four years before the closing of this announcement meets the basic eligibility requirement to apply for the DHA Recent Graduates Program. You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Please submit copies of all transcripts, to include transferred hours-official copies are not required at time of application. If selected, you will be required to provide official copies of all transcripts. NOTE: Degree Audits are not accepted. If you qualify based on undergraduate, or higher level education, and you have not graduated prior to applying for this position, you may be offered a position, contingent upon your final grade point average or class ranking. IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"For DHA Positions:These positions are being filled under Direct-Hire Authority for the DoD for Post-Secondary Students and Recent Graduates. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified students and recent graduates directly into competitive service positions; positions may be professional or administrative occupations and located Air Force-Wide. Positions may be filled as permanent/term with a full-time/part-time work schedule. Pay will vary by geographic location. *** The term \"recent graduate\" means a person awarded a degree by an institution of higher education not more than 2 years before the date of the appointment of such person, except in the case of a person who has completed a period of obligated service in a uniform service of more than 4 years. You must have completed a 4 year course of study leading to a bachelor's from an accredited institution AND must have documented Superior Academic Achievement (SAA) at the undergraduate level in one of the following: a) Class Standing - upper third of the graduating class based on completed courses in the college, university, or major subdivision; b) Grade Point Average - 2.95 or higher out of a possible 4.0 as recorded on your official transcript or as computed based on 4 years of education or as computed based on courses completed during the final 2 years of curriculum; OR 3.45 or higher out of a possible 4.0 based on the average of the required courses completed in your major field or the required courses in your major field completed during the final 2 years of your curriculum. If more than 10 percent of total undergraduate credit hours are non-graded, i.e. pass/fail, CLEP, CCAF, DANTES, military credit, etc, you cannot qualify based on GPA; c) Election to membership in a national scholastic honor society (note: freshman honor society cannot be used to meet the requirements of this position). (If qualifying based on class standing or honor society membership, provide appropriate documentation). Your latest resume will be used to determine your qualifications. Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 09/30/2022. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11234241 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"After you submit your application, you will be contacted if further evaluation or interviews are required. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply.","RequiredDocuments":"The following documents are required and must be provided with your application for this Public Notice. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application - Questionnaire Resume - For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service/discharge and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Selective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here. Student Loan Repayment Program (SLRP): SLRP may be offered for eligible candidates. (Must sign a 3-year service agreement.) Direct Deposit: All federal employees are required to have direct deposit. This Public Notice is to gather applications which may or may not result in a referral or selection. Notice of Results (NOR) will not be sent to applicants under this authority. Please do not contact this office for status. If you are selected for this position, you will be contacted. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11234241 Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Secret","DrugTestRequired":"False","PositionSensitivitiy":"Noncritical-Sensitive (NCS)/Moderate Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"619929500","MatchedObjectDescriptor":{"PositionID":"AFPC-ACWA-0201-2022","PositionTitle":"Human Resources Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/619929500","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/619929500?PostingChannelID="],"PositionLocationDisplay":"Multiple Locations","PositionLocation":[{"LocationName":"Davis Monthan AFB, Arizona","CountryCode":"United States","CountrySubDivisionCode":"Arizona","CityName":"Davis Monthan AFB, Arizona","Longitude":-110.8475,"Latitude":32.1566},{"LocationName":"Beale AFB, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Beale AFB, California","Longitude":-121.3373,"Latitude":39.0943},{"LocationName":"Edwards AFB, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Edwards AFB, California","Longitude":-117.8332,"Latitude":34.8898},{"LocationName":"Air Force Academy, Colorado","CountryCode":"United States","CountrySubDivisionCode":"Colorado","CityName":"Air Force Academy, Colorado","Longitude":-104.85452,"Latitude":38.99115},{"LocationName":"Andrews AFB, Maryland","CountryCode":"United States","CountrySubDivisionCode":"Maryland","CityName":"Andrews AFB, Maryland","Longitude":-76.8765,"Latitude":38.8054},{"LocationName":"Charleston, South Carolina","CountryCode":"United States","CountrySubDivisionCode":"South Carolina","CityName":"Charleston, South Carolina","Longitude":-79.9316,"Latitude":32.781155},{"LocationName":"Fort Sam Houston, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Fort Sam Houston, Texas","Longitude":-98.4489,"Latitude":29.4491},{"LocationName":"Lackland AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Lackland AFB, Texas","Longitude":-98.6181,"Latitude":29.3861},{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275},{"LocationName":"McChord AFB, Washington","CountryCode":"United States","CountrySubDivisionCode":"Washington","CityName":"McChord AFB, Washington","Longitude":-122.50157,"Latitude":47.128696}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Multiple Schedules","Code":"6"}],"PositionOfferingType":[{"Name":"Multiple Appointment Types","Code":"15327"}],"QualificationSummary":"GS-05: Three years of general experience, one year of which was equivalent to the next lower grade (GS-04) or equivalent. General experience is experience which demonstrates the ability to (1) analyze problems to identify significant factors, gather pertinent data, and recognize solutions; (2) plan and organize work; and (3) communicate effectively orally and in writing. NOTE: YOUR RESUME MUST SUPPORT THIS STATEMENT OR Successful completion of a full 4-year course of study in any field leading to a bachelor's degree from an accredited college or university. NOTE: YOU MUST SUBMIT COPIES OF YOUR OFFICIAL TRANSCRIPT GS-07: At least one year of specialized experience equivalent to at least the GS-05 level or equivalent pay systems which has equipped me with the particular knowledge, skills, and abilities to successfully perform the duties of the position. Examples includes analyzing, developing and evaluating issues and delivering human resources management products or services. NOTE: YOUR RESUME MUST SUPPORT THIS STATEMENT OR Successful completion of one year of full-time graduate education which demonstrate the knowledge, skills, and abilities necessary to do the work of the position being filled or superior academic achievement. NOTE: YOU MUST SUBMIT COPIES OF YOUR OFFICIAL TRANSCRIPT To view qualifying educational requirements and/or combination of education and specialized experience click on the following link: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=GS-ADMIN KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas: 1. Knowledge of basic principles of the Human Resources or related fields.\n2. Skill in communicating factual and procedural information clearly, orally and in writing.\n3. Ability to learn basic techniques in Human Resources actions.\n4. Ability to analyze problems to identify significant factors, gather pertinent data, and recognize solutions.\n5. Ability to plan and organize work, and consult effectively with co-workers. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"30414.0","MaximumRange":"48978.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-01T00:00:00.0000","PositionEndDate":"2022-12-31T23:59:59.9970","PublicationStartDate":"2022-01-01T00:00:00.0000","ApplicationCloseDate":"2022-12-31T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"This announcement may be used to fill one or more vacancies at the grades GS-05 and GS-07 only. There may be promotion potential up to the GS-9 or higher. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"5","HighGrade":"7","PromotionPotential":"7","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["public"],"TotalOpenings":"Many","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. Applications will be accepted from United States citizens (U.S. citizenship required at time of application). Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here. For information on veteran's preference click here. This announcement may be used to fill one or more vacancies at the grades GS-05 and GS-07 only. Positions are located Air Force-Wide. Positions may be filled as permanent, temporary or term with a full-time or part-time work schedule. Pay will vary by geographic location. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK).","TravelCode":"0","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["****Duties and responsibilities vary and may increase according to grade level****","Follow instructions given by the supervisor or a higher-graded specialist, perform highly structured work assignments of limited difficulty combined with training","Perform recurring technical assignments where few problems are expected to arise.","Draft or prepare a variety of documents to include responses to routine inquiries, reports, letters, and other related documents.","Perform developmental assignments of moderate difficulty where work procedures are established and a number of specific guidelines exist."],"Education":"IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience, transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your qualifications for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further. \"Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement.\" More information on COVID requirements may be found at: https://www.saferfederalworkforce.gov/faq/vaccinations/.","HowToApply":"The complete application package must be submitted by 11:59 PM (ET) on the 12/31/2022the announcement to receive consideration. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11232611 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"Once the online questionnaire is received you will receive an acknowledgement email. A Human Resources Specialist will assess your qualifications based upon the responses you provided, as well as any other documents requested in the announcement if a request is received to fill a position at a location you applied to for consideration. To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select My Applications, and click on the More Information link under the application status for this position. If you do not provide an email address, you are responsible for checking status updates and notifications in USAJOBS. Hard copy notifications will not be sent to you.","RequiredDocuments":"The following documents are required and must be provided with your application. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents. Online Application - Questionnaire Resume - For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, you must submit an active, current registration/license. Veterans: If claiming 30% Disabled Veteran or Veteran's Preference - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 21 If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service/discharge and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated well qualified or above for this position. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. The law made taxable certain reimbursements and other payments, including driving mileage, airfare and lodging expenses, en-route travel to the new duty station, and temporary storage of those items. The Federal Travel Regulation Bulletin (FTR) 18-05 issued by General Services Administration (GSA) has authorized agencies to use the Withholding Tax Allowance (WTA) and Relocation Income Tax Allowance (RITA) to pay for \"substantially all\" of the increased tax liability resulting from the \"2018 Tax Cuts and Jobs Act\" for certain eligible individuals. For additional information on WTA/RITA allowances and eligibilities please click here. Subsequently, FTR Bulletin 20-04 issued by GSA, provides further information regarding NDAA FY2020, Public Law 116-92, and the expansion of eligibility beyond \"transferred\" for WTA/RITA allowances. For additional information, please click here.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","AdjudicationType":[],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"634817000","MatchedObjectDescriptor":{"PositionID":"U-22-DHA-11378174-DJL","PositionTitle":"Human Resources Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/634817000","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/634817000?PostingChannelID="],"PositionLocationDisplay":"Randolph AFB, Texas","PositionLocation":[{"LocationName":"Randolph AFB, Texas","CountryCode":"United States","CountrySubDivisionCode":"Texas","CityName":"Randolph AFB, Texas","Longitude":-98.2775,"Latitude":29.5275}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","SubAgency":"AFPC CSA Force Renewal/DP2ICR - MAJCOM's Will Vary","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To qualify for a GS-07: Completion of 1 full year of graduate level education, or bachelor's degree with Superior Academic Achievement as provided in the \"General Policies and Instructions\" for Qualifications Standards Operating Manual, or 5 academic years of pre-professional study, or 1 year specialized experience equivalent to at least GS-5. Experience refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-05, or equivalent in other pay systems. Examples of specialized experience includes: providing support for Human Resources (HR) specialists involved in using HR information systems; in delivering HR services to military personnel; and in classification, recruitment and placement, employee benefits, human resource development, performance management, and employee and labor management relations. Process and document HR actions for a wide variety of employee categories that involve different forms, different authorities, different action codes, and different regulatory authorities, or additional pay systems. Obtain missing data from HR files or the appropriate office; assist employees in preparing paperwork related to HR actions; review finished forms for completeness and adequacy; contact individual employees or supervisors by telephone to resolve questions before processing final actions; provide information on HR systems, processes and procedures; and/or provide brochures, applications and other HR documents to employees. This experience MUST be equivalent to at least the GS-05 level in Federal service, which could have been obtained in the private or public sectors. Applicants in the Best-qualified category will be referred to the selecting official for further review. To view qualifying educational requirements and/or combination of education and specialized experience, click on the following link: http://www.opm.gov/qualifications/standards/indexes/num-ndx.asp Once the application and selection process is complete, a review of your application will be made to ensure you meet the applicable OPM qualification requirements. To determine if you are qualified for this job, a review of your resume and supporting documentation will be made. Applicants who fail to provide the necessary documentation to support their educational grade point average/master's degree requirements, qualifying experience or veterans' preference claim will be determined incomplete, ineligible or not identified as claiming veterans' preference. Please follow all instructions carefully. Errors or omissions may affect your consideration in the referral and selection process. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of basic principles and practices of human resources.\n2. Ability to communicate effectively with others, both orally and in writing.\n3. Ability to gather facts and use effective analytical, and evaluative methods to accurately assess information and formulate solutions to problems.\n4. Ability to manage several projects simultaneously. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"45199.0","MaximumRange":"58754.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-02-02T13:49:32.5170","PositionEndDate":"2022-09-30T23:59:59.9970","PublicationStartDate":"2022-02-02T13:49:32.5170","ApplicationCloseDate":"2022-09-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The primary purpose of this position is to perform a variety of conventional duties relating to a variety of human relations program areas and to complete developmental assignments and training outlined in the formal training and development program.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"7","PromotionPotential":"11","SubAgencyName":"AFPC CSA Force Renewal/DP2ICR - MAJCOM's Will Vary","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["graduates","public"],"TotalOpenings":"FEW","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. For Direct Hire Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). See \"Additional Information\" in this announcement for further information regarding DHA Positions.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["-Performs a variety of highly structured, entry-level human resources work designed to develop broader and more in-depth knowledge and skill to perform higher level assignments.\n-Performs a variety of routine work assignments selected by the supervisor or experienced employee who serves as training monitor.\n-Observes and assists an experienced employee by performing routine tasks, such as reviewing basic qualifications requirements; analyzing position data; preparing job descriptions; reviewing and applying procedures pertaining to employee relations."],"Education":"Any individual who was awarded a degree by an institution of higher education from a PUBLIC or other non-profit institution not more than two years before the date of appointment meets the basic eligibility requirement to apply for the DHA Recent Graduates Program; OR Any individual who has completed a period of obligated service in a uniformed service of more than four years and was awarded a degree by an institution of higher education from a public or other non-profit institution not more than four years before the closing of this announcement meets the basic eligibility requirement to apply for the DHA Recent Graduates Program. You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Please submit copies of all transcripts, to include transferred hours-official copies are not required at time of application. If selected, you will be required to provide official copies of all transcripts. NOTE: Degree Audits are not accepted. If you qualify based on undergraduate, or higher level education, and you have not graduated prior to applying for this position, you may be offered a position, contingent upon your final grade point average or class ranking. IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"For DHA Positions:\nThese positions are being filled under Direct-Hire Authority for the DoD for Post-Secondary Students and Recent Graduates. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified students and recent graduates directly into competitive service positions; positions may be professional or administrative occupations and located Air Force-Wide. Positions may be filled as permanent/term with a full-time/part-time work schedule. Pay will vary by geographic location. *** The term \"recent graduate\" means a person awarded a degree by an institution of higher education not more than 2 years before the date of the appointment of such person, except in the case of a person who has completed a period of obligated service in a uniform service of more than 4 years. You must have completed a 4 year course of study leading to a bachelor's from an accredited institution AND must have documented Superior Academic Achievement (SAA) at the undergraduate level in one of the following: a) Class Standing - upper third of the graduating class based on completed courses in the college, university, or major subdivision; b) Grade Point Average - 2.95 or higher out of a possible 4.0 as recorded on your official transcript or as computed based on 4 years of education or as computed based on courses completed during the final 2 years of curriculum; OR 3.45 or higher out of a possible 4.0 based on the average of the required courses completed in your major field or the required courses in your major field completed during the final 2 years of your curriculum. If more than 10 percent of total undergraduate credit hours are non-graded, i.e. pass/fail, CLEP, CCAF, DANTES, military credit, etc, you cannot qualify based on GPA; c) Election to membership in a national scholastic honor society (note: freshman honor society cannot be used to meet the requirements of this position). (If qualifying based on class standing or honor society membership, provide appropriate documentation). Your latest resume will be used to determine your qualifications. Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 09/30/2022. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11378174 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"After you submit your application, you will be contacted if further evaluation or interviews are required. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply.","RequiredDocuments":"The following documents are required and must be provided with your application for this Public Notice. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application - Questionnaire Resume - For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service/discharge and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11378174 To ensure compliance with an applicable preliminary nationwide injunction, which may be supplemented, modified, or vacated, depending on the course of ongoing litigation, the Federal Government will take no action to implement or enforce the COVID-19 vaccination requirement pursuant to Executive Order 14043 on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees. Therefore, to the extent a Federal job announcement includes the requirement that applicants must be fully vaccinated against COVID-19 pursuant to Executive Order 14043, that requirement does not currently apply. Federal agencies may request information regarding the vaccination status of selected applicants for the purposes of implementing other workplace safety protocols, such as protocols related to masking, physical distancing, testing, travel, and restriction from the workplace. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0},{"MatchedObjectId":"630042100","MatchedObjectDescriptor":{"PositionID":"U-22-DHA-11346830-DJL","PositionTitle":"Human Resources Specialist","PositionURI":"https://www.usajobs.gov:443/GetJob/ViewDetails/630042100","ApplyURI":["https://www.usajobs.gov:443/GetJob/ViewDetails/630042100?PostingChannelID="],"PositionLocationDisplay":"Vandenberg AFB, California","PositionLocation":[{"LocationName":"Vandenberg AFB, California","CountryCode":"United States","CountrySubDivisionCode":"California","CityName":"Vandenberg AFB, California","Longitude":-120.54249,"Latitude":34.75468}],"OrganizationName":"Department of the Air Force - Agency Wide","DepartmentName":"Department of the Air Force","SubAgency":"AFPC CSA Force Renewal/DP2ICR - MAJCOM's Will Vary","JobCategory":[{"Name":"Human Resources Management","Code":"0201"}],"JobGrade":[{"Code":"GS"}],"PositionSchedule":[{"Name":"Full-time","Code":"1"}],"PositionOfferingType":[{"Name":"Permanent","Code":"15317"}],"QualificationSummary":"To qualify for a GS-07: Completion of 1 full year of graduate level education, or bachelor's degree with Superior Academic Achievement as provided in the \"General Policies and Instructions\" for Qualifications Standards Operating Manual, or 5 academic years of pre-professional study, or 1 year specialized experience equivalent to at least GS-5. Experience refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. SPECIALIZED EXPERIENCE: Applicants must have at least one (1) year of specialized experience at the next lower grade GS-05, or equivalent in other pay systems. Examples of specialized experience includes: providing support for Human Resources (HR) specialists involved in using HR information systems; in delivering HR services to military personnel; and in classification, recruitment and placement, employee benefits, human resource development, performance management, and employee and labor management relations. Process and document HR actions for a wide variety of employee categories that involve different forms, different authorities, different action codes, and different regulatory authorities, or additional pay systems. Obtain missing data from HR files or the appropriate office; assist employees in preparing paperwork related to HR actions; review finished forms for completeness and adequacy; contact individual employees or supervisors by telephone to resolve questions before processing final actions; provide information on HR systems, processes and procedures; and/or provide brochures, applications and other HR documents to employees. This experience MUST be equivalent to at least the GS-05 level in Federal service, which could have been obtained in the private or public sectors. Applicants in the Best-qualified category will be referred to the selecting official for further review. To view qualifying educational requirements and/or combination of education and specialized experience, click on the following link: http://www.opm.gov/qualifications/standards/indexes/num-ndx.asp Once the application and selection process is complete, a review of your application will be made to ensure you meet the applicable OPM qualification requirements. To determine if you are qualified for this job, a review of your resume and supporting documentation will be made. Applicants who fail to provide the necessary documentation to support their educational grade point average/master's degree requirements, qualifying experience or veterans' preference claim will be determined incomplete, ineligible or not identified as claiming veterans' preference. Please follow all instructions carefully. Errors or omissions may affect your consideration in the referral and selection process. KNOWLEDGE, SKILLS AND ABILITIES (KSAs): Your qualifications will be evaluated on the basis of your level of knowledge, skills, abilities and/or competencies in the following areas:\n1. Knowledge of basic principles and practices of human resources.\n2. Ability to communicate effectively with others, both orally and in writing.\n3. Ability to gather facts and use effective analytical, and evaluative methods to accurately assess information and formulate solutions to problems.\n4. Ability to manage several projects simultaneously. PART-TIME OR UNPAID EXPERIENCE: Credit will be given for appropriate unpaid and or part-time work. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week. VOLUNTEER WORK EXPERIENCE: Refers to paid and unpaid experience, including volunteer work done through National Service Programs (i.e., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student and social). Volunteer work helps build critical competencies, knowledge and skills that can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.","PositionRemuneration":[{"MinimumRange":"51444.0","MaximumRange":"66872.0","RateIntervalCode":"Per Year"}],"PositionStartDate":"2022-01-06T15:01:46.7830","PositionEndDate":"2022-09-30T23:59:59.9970","PublicationStartDate":"2022-01-06T15:01:46.7830","ApplicationCloseDate":"2022-09-30T23:59:59.9970","PositionFormattedDescription":[{"Label":"Dynamic Teaser","LabelDescription":"Hit highlighting for keyword searches."}],"UserArea":{"Details":{"JobSummary":"Click on \"Learn more about this agency\" button below for IMPORTANT additional information. The primary purpose of this position is to perform a variety of conventional duties relating to a variety of human relations program areas and to complete developmental assignments and training outlined in the formal training and development program.","WhoMayApply":{"Name":"","Code":""},"LowGrade":"7","HighGrade":"7","PromotionPotential":"11","SubAgencyName":"AFPC CSA Force Renewal/DP2ICR - MAJCOM's Will Vary","OrganizationCodes":"DD/AF00","Relocation":"False","HiringPath":["graduates","public"],"TotalOpenings":"few","AgencyMarketingStatement":"The mission of the United States Air Force is: To fly, fight, and win ... Airpower anytime, anywhere. To achieve that mission, the Air Force has a vision of Global Vigilance, Global Reach and Global Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. For Direct Hire Positions:\nThis is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection. This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK). See \"Additional Information\" in this announcement for further information regarding DHA Positions.","TravelCode":"1","ApplyOnlineUrl":"https://apply.usastaffing.gov/Application/Apply","DetailStatusUrl":"https://apply.usastaffing.gov/Application/ApplicationStatus","MajorDuties":["-Performs a variety of highly structured, entry-level human resources work designed to develop broader and more in-depth knowledge and skill to perform higher level assignments.\n-Performs a variety of routine work assignments selected by the supervisor or experienced employee who serves as training monitor.\n-Observes and assists an experienced employee by performing routine tasks, such as reviewing basic qualifications requirements; analyzing position data; preparing job descriptions; reviewing and applying procedures pertaining to employee relations."],"Education":"Any individual who was awarded a degree by an institution of higher education from a PUBLIC or other non-profit institution not more than two years before the date of appointment meets the basic eligibility requirement to apply for the DHA Recent Graduates Program; OR Any individual who has completed a period of obligated service in a uniformed service of more than four years and was awarded a degree by an institution of higher education from a public or other non-profit institution not more than four years before the closing of this announcement meets the basic eligibility requirement to apply for the DHA Recent Graduates Program. You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. Please submit copies of all transcripts, to include transferred hours-official copies are not required at time of application. If selected, you will be required to provide official copies of all transcripts. NOTE: Degree Audits are not accepted. If you qualify based on undergraduate, or higher level education, and you have not graduated prior to applying for this position, you may be offered a position, contingent upon your final grade point average or class ranking. IF USING EDUCATION TO QUALIFY: If position has a positive degree requirement or education forms the basis for qualifications, you MUST submit transcripts with the application. Official transcripts are not required at the time of application; however, if position has a positive degree requirement, qualifying based on education alone or in combination with experience; transcripts must be verified prior to appointment. An accrediting institution recognized by the U.S. Department of Education must accredit education. Click here to check accreditation. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.","Requirements":"","Evaluations":"For DHA Positions:\nThese positions are being filled under Direct-Hire Authority for the DoD for Post-Secondary Students and Recent Graduates. The Secretary of the Air Force has delegated authority by the Office of the Secretary of Defense to directly appoint qualified students and recent graduates directly into competitive service positions; positions may be professional or administrative occupations and located Air Force-Wide. Positions may be filled as permanent/term with a full-time/part-time work schedule. Pay will vary by geographic location. *** The term \"recent graduate\" means a person awarded a degree by an institution of higher education not more than 2 years before the date of the appointment of such person, except in the case of a person who has completed a period of obligated service in a uniform service of more than 4 years. You must have completed a 4 year course of study leading to a bachelor's from an accredited institution AND must have documented Superior Academic Achievement (SAA) at the undergraduate level in one of the following: a) Class Standing - upper third of the graduating class based on completed courses in the college, university, or major subdivision; b) Grade Point Average - 2.95 or higher out of a possible 4.0 as recorded on your official transcript or as computed based on 4 years of education or as computed based on courses completed during the final 2 years of curriculum; OR 3.45 or higher out of a possible 4.0 based on the average of the required courses completed in your major field or the required courses in your major field completed during the final 2 years of your curriculum. If more than 10 percent of total undergraduate credit hours are non-graded, i.e. pass/fail, CLEP, CCAF, DANTES, military credit, etc, you cannot qualify based on GPA; c) Election to membership in a national scholastic honor society (note: freshman honor society cannot be used to meet the requirements of this position). (If qualifying based on class standing or honor society membership, provide appropriate documentation). Your latest resume will be used to determine your qualifications. Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. Your responses to the questionnaire may be compared to the documents you submit. The documents you submit must support your responses to the online questionnaire. If your application contradicts or does not support your questionnaire responses, you will receive a rating of \"not qualified\" or \"insufficient information\" and you will not receive further consideration for this job. Applicants who disqualify themselves will not be evaluated further.","HowToApply":"The complete Application Package must be submitted by 11:59 PM (ET) on 09/30/2022. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/11346830 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications). If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. A complete Application Questionnaire 3. Additional Required Documents (see Required Documents section). Ensure all submitted documents contain your full name. PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant.","WhatToExpectNext":"After you submit your application, you will be contacted if further evaluation or interviews are required. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply.","RequiredDocuments":"The following documents are required and must be provided with your application for this Public Notice. Applicants who do not submit required documentation to determine eligibility and qualifications will be eliminated from consideration. Other documents may be required based on the eligibility/eligibilities you are claiming. Click here to view the AF Civilian Employment Eligibility Guide and the required documents you must submit to substantiate the eligibilities you are claiming. Online Application - Questionnaire Resume - For qualification determinations your resume must contain hours worked per week (if part-time) and dates of employment (i.e., month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. If you are a current Federal employee or previous Federal employee, provide your pay plan, series and grade, i.e. GS-0301-09. Current Federal Civilian Employees should list any relevant performance related rating (given within the last three years) and/or incentive awards in your resume. Do NOT include photographs (or links to social media such as LinkedIn), inappropriate material, inappropriate content, nor personal information such as age, gender, religion, social security number, etc., on your resume. Transcripts/Registration/License: If qualifying on education/position requires education, you must submit copies of your transcripts and if required for the position, submit an active, current registration/license. Veterans: If claiming VEOA, VRA or 30% Disabled Veteran - Submit VOW certification memo or copy of the official DD-Form 214, which must include the character of service (i.e., with an honorable or general discharge). This will be annotated in block 24 on member copy 2, 4, or 7 of the DD-Form 214. If claiming 30% Disabled Veteran, you must also submit a VA Letter or a disability determination from a branch of the Armed Forces. NOTE: All veterans claiming 10-point preference must also submit a SF-15. ACTIVE DUTY SERVICE MEMBERS: The VOW Act requires federal agencies to treat an eligible active duty service member as a veteran, disabled veteran, and preference eligible (as applicable) when applying for civil service positions before the effective release or discharge date. Appointment of military members before the release or discharge date is permissible if the member is on terminal leave. At the time the active duty member applies for a civil position, he or she must submit a \"certification\" memo in lieu of a DD-Form 214, Certificate of Release or Discharge from Active Duty. Active duty members applying for a civil service position without submitting a valid certification memo or DD-Form 214 with their application will render the member ineligible for the position. The certification memo must originate from the member's military service branch on official letterhead and contain the following: Name/Rank/Grade of Service Member Branch of Armed Forces Dates of Active Service (Start and End Date(s) Expected Date of Discharge/Release from Active Duty Terminal leave start date (if applicable) Expected character of service/discharge and type of separation (i.e. separation or retirement) Must be certified within 120 days of anticipated discharge Signature by, or by direction of the adjutant, personnel office, unit commander, or higher headquarters commander. Note: The VOW Act provides tentative preference. If appointed, a DD Form-214 must be submitted upon receipt.","Benefits":"","BenefitsUrl":"https://www.usajobs.gov/Help/working-in-government/benefits/","BenefitsDisplayDefaultText":true,"OtherInformation":"Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. If you are unable to apply online, view the following link for information regarding Alternate Application. The Vacancy ID is 11346830 Department of the Air Force has implemented COVID-19 vaccination requirements set forth in Executive Order 14043. Federal employees are required to be fully vaccinated against COVID-19 regardless of the employee's duty location or work arrangement (e.g., telework, remote work, etc.), subject to such exceptions as required by law. Upon selection, you will be required to provide documentation proof as \"fully vaccinated\" prior to issuance of a firm job offer. Air Force will provide additional information regarding what information or documentation will be needed and how you can request a legally required exemption from this requirement. More information on COVID requirements may be found here. Additionally, please do not disclose your vaccination status on your resume. If you have questions regarding this announcement and have hearing or speech difficulties click here. Tax Law Impact for PCS: On 22-Dec-2017, Public Law 115-97 - the \"Tax Cuts and Jobs Act of 2017\" suspended qualified moving expense deductions along with the exclusion for employer reimbursements and payments of moving expenses effective 01-Jan-2018 for tax years 2018 through 2025. When you perform a Civilian Permanent Change of Station (PCS) with the government, the Internal Revenue Service (IRS) considers the majority of your entitlements to be taxable. Visit GSA Bulletin FTR 20-04 here for additional information.","KeyRequirements":[],"WithinArea":"False","CommuteDistance":"0","ServiceType":"01","AnnouncementClosingType":"01","AgencyContactEmail":"DO.NOT.EMAIL@CALL.ONLY","AgencyContactPhone":"1-800-525-0102","SecurityClearance":"Not Required","DrugTestRequired":"False","PositionSensitivitiy":"Non-sensitive (NS)/Low Risk","AdjudicationType":["Suitability/Fitness"],"TeleworkEligible":false,"RemoteIndicator":false},"IsRadialSearch":false}},"RelevanceRank":0}],"UserArea":{"NumberOfPages":"1","IsRadialSearch":false}}}